<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"8550012e7df4a27b256a9b1172b4b3ee35247b23dbd7867cc2a95555a987ebe4","plan_job_ref":"Job Create terraform plan #52 at https://github.com/presentium/infrastructure/actions/runs/10514227373","plan_out_hash":"79379fd533f2bd271eb92a3814c34e14da78bec1cc3004a3cd578955a809e899","plan_hash":"a1be2f7114adaef7144611f7a5223e339aa7154ae59b61c7a5250232813d9ed5","plan_text_format":"diff","version":"1.44.0","closed":true} -->
Terraform plan in __infrastructure__
<details>
<summary>Plan: 2 to add, 0 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # module.cloudflare.cloudflare_record.docs_record will be destroyed
  # (because cloudflare_record.docs_record is not in configuration)
-   resource "cloudflare_record" "docs_record" {
-       allow_overwrite = false -> null
-       created_on      = "2024-07-12T15:15:31.328824Z" -> null
-       hostname        = "docs.presentium.ch" -> null
-       id              = "abbb5466ef6180c80c9ac7d72f452c49" -> null
-       metadata        = {
-           "auto_added"             = "false"
-           "managed_by_apps"        = "false"
-           "managed_by_argo_tunnel" = "false"
        } -> null
-       modified_on     = "2024-07-12T15:15:31.328824Z" -> null
-       name            = "docs" -> null
-       proxiable       = true -> null
-       proxied         = false -> null
-       tags            = [] -> null
-       ttl             = 1 -> null
-       type            = "CNAME" -> null
-       value           = "presentium.github.io" -> null
-       zone_id         = "660bdc1364b1611625fb1a09ffe6e289" -> null
#        (1 unchanged attribute hidden)
    }

  # module.eks.module.ebs_csi_irsa.aws_iam_policy.ebs_csi[0] will be created
+   resource "aws_iam_policy" "ebs_csi" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Provides permissions to manage EBS volumes via the container storage interface driver"
+       id               = (known after apply)
+       name             = (known after apply)
+       name_prefix      = "AmazonEKS_EBS_CSI_Policy-"
+       path             = "/"
+       policy           = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ec2:ModifyVolume",
+                           "ec2:EnableFastSnapshotRestores",
+                           "ec2:DetachVolume",
+                           "ec2:DescribeVolumesModifications",
+                           "ec2:DescribeVolumes",
+                           "ec2:DescribeTags",
+                           "ec2:DescribeSnapshots",
+                           "ec2:DescribeInstances",
+                           "ec2:DescribeAvailabilityZones",
+                           "ec2:CreateSnapshot",
+                           "ec2:AttachVolume",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
+                   {
+                       Action    = "ec2:CreateTags"
+                       Condition = {
+                           StringEquals = {
+                               "ec2:CreateAction" = [
+                                   "CreateVolume",
+                                   "CreateSnapshot",
                                ]
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = [
+                           "arn:aws:ec2:*:*:volume/*",
+                           "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
+                   {
+                       Action   = "ec2:DeleteTags"
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:ec2:*:*:volume/*",
+                           "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/CSIVolumeName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/CSIVolumeName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/kubernetes.io/created-for/pvc/name" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteSnapshot"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/CSIVolumeSnapshotName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteSnapshot"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = [
+                           "kms:RevokeGrant",
+                           "kms:ListGrants",
+                           "kms:CreateGrant",
                        ]
+                       Condition = {
+                           Bool = {
+                               "kms:GrantIsForAWSResource" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "5e8f9752-11b3-477b-87c3-4b8010b9b3ee"
                    },
+                   {
+                       Action   = [
+                           "kms:ReEncrypt*",
+                           "kms:GenerateDataKey*",
+                           "kms:Encrypt",
+                           "kms:DescribeKey",
+                           "kms:Decrypt",
                        ]
+                       Effect   = "Allow"
+                       Resource = "5e8f9752-11b3-477b-87c3-4b8010b9b3ee"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Terraform" = "true"
        }
    }

  # module.eks.module.ebs_csi_irsa.aws_iam_role_policy_attachment.ebs_csi[0] will be created
+   resource "aws_iam_role_policy_attachment" "ebs_csi" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "PRES-EBS-CSI-PRESENTIUM"
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```
</details>

:x: Error applying plan in [Apply terraform plan #25](https://github.com/presentium/infrastructure/actions/runs/10514258285)